create a series  for 5 persons going to play cricket, take their name as index, age, place from where they are.Create a dataframe, after that append cost spend by each person for there travel to reach the ground then add 2 new persons to the series and show all 7 person in the list. Keep that data structure as it is and copy the dataframe then from the copied one remove the first 2 persons details then change the cost of remaining 5 personsby increasing 10 to each.

In [72]:
import numpy as np
import pandas as pd

In [73]:
p1 = pd.Series({'Name': 'Romil',
                'age': 22,
                'place': 'Hubli'})
p2 = pd.Series({'Name': 'Abhay',
                'age': 23,
                'place': 'Pune'})
p3 = pd.Series({'Name': 'Mayank',
                'age': 24,
                'place': 'Nashik'})
p4 = pd.Series({'Name': 'Piyush',
                'age': 22,
                'place': 'Mumbai'})
p5 = pd.Series({'Name': 'Ronak',
                'age': 26,
                'place': 'Bangalore'})

df = pd.DataFrame([p1,p2,p3,p4,p5])
df.head(len(df))

     Name  age      place
0   Romil   22      Hubli
1   Abhay   23       Pune
2  Mayank   24     Nashik
3  Piyush   22     Mumbai
4   Ronak   26  Bangalore

In [74]:
df['cost'] = [10,20,30,40,50]
df.head(len(df))

     Name  age      place  cost
0   Romil   22      Hubli    10
1   Abhay   23       Pune    20
2  Mayank   24     Nashik    30
3  Piyush   22     Mumbai    40
4   Ronak   26  Bangalore    50

In [75]:
p6 = pd.Series({'Name': 'Rakesh',
                'age': 20,
                'place': 'Delhi',
                'cost' : 60})
p7 = pd.Series({'Name': 'Rohan',
                'age': 23,
                'place': 'Chennai',
                'cost' : 70})

df =df.append([p6,p7],ignore_index=True)
df.head(len(df))

     Name  age      place  cost
0   Romil   22      Hubli    10
1   Abhay   23       Pune    20
2  Mayank   24     Nashik    30
3  Piyush   22     Mumbai    40
4   Ronak   26  Bangalore    50
5  Rakesh   20      Delhi    60
6   Rohan   23    Chennai    70

In [76]:
new_df = df.copy()
new_df = new_df.drop([0,1])
new_df.head(len(new_df))

     Name  age      place  cost
2  Mayank   24     Nashik    30
3  Piyush   22     Mumbai    40
4   Ronak   26  Bangalore    50
5  Rakesh   20      Delhi    60
6   Rohan   23    Chennai    70

In [77]:
new_df['cost'] = new_df['cost'] + 10
new_df.head(len(new_df))

     Name  age      place  cost
2  Mayank   24     Nashik    40
3  Piyush   22     Mumbai    50
4   Ronak   26  Bangalore    60
5  Rakesh   20      Delhi    70
6   Rohan   23    Chennai    80